Importing libraries

In [1]:
## Importing libraries

from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

Establishing the connection with MySQL

In [2]:
# this is the general syntax 'dialect+driver://username:password@host:port/database'
# to create the connection string

connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
# data = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
# data.head()

Check the number of rentals for each customer for May

In [3]:
# Calling the SQL query:

engine.execute("USE sakila")

query = "select customer_id, count(rental_id) as nr_of_rentals \
from rentals_may \
group by customer_id \
order by nr_of_rentals DESC" \

# order by nr_of_rentals DESC;


data_may = pd.read_sql_query(query, engine)
data_may.head()

   customer_id  nr_of_rentals
0          197              8
1           19              6
2          371              6
3          245              6
4          274              6

Check the number of rentals for each customer for June

In [4]:
engine.execute("USE sakila")

query2 = "select customer_id, count(rental_id) as nr_of_rentals \
from rentals_june \
group by customer_id \
order by nr_of_rentals DESC" \


# order by nr_of_rentals DESC;


data_june = pd.read_sql_query(query2, engine)
data_june.head()

   customer_id  nr_of_rentals
0           31             11
1          454             10
2          329              9
3          295              9
4          561              9

Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

In [5]:
result = pd.merge(data_may, data_june, how="outer", on="customer_id")
result.columns = ['customer_id', 'number_rentals_may', 'number_rentals_june']
result[["number_rentals_may", "number_rentals_june"]] = result[["number_rentals_may", "number_rentals_june"]].fillna(0)

result[["number_rentals_may", "number_rentals_june"]] = result[["number_rentals_may", "number_rentals_june"]].astype(int)

result.drop_duplicates(subset ="customer_id", keep = False, inplace = True)

result["More_rentals_in"]=result["number_rentals_may"]-result["number_rentals_june"]

result.head()

   customer_id  number_rentals_may  number_rentals_june  More_rentals_in
0          197                   8                    8                0
1           19                   6                    3                3
2          371                   6                    7               -1
3          245                   6                    3                3
4          274                   6                    2                4

In [6]:
dif_rentals=[]
customer_id=[]

for ele in range(0, result.shape[0]):
    customer_id.append(result.iloc[ele][0])

for ele in range(0, result.shape[0]):
    dif_rentals.append(result.iloc[ele][3])

rental_month=list(map(lambda x: "May" if x > 0  else ("June" if x>0 else "Same"), dif_rentals))

new_df=pd.DataFrame({"customer_id" : customer_id, "more_rentals_in":rental_month})
new_df.head()

   customer_id more_rentals_in
0          197            Same
1           19             May
2          371            Same
3          245             May
4          274             May

In [14]:
def rental(films_may, films_june):
    dif_rentals = []
    customer_id = []
    result = pd.merge(data_may, data_june, how="outer", on="customer_id")
    result.columns = ['customer_id','number_rentals_may', 'number_rentals_june']
    result[["number_rentals_may", "number_rentals_june"]] = result[["number_rentals_may", "number_rentals_june"]].fillna(0).astype(int)
    result["More_rentals_in"]=result["number_rentals_may"]-result["number_rentals_june"]
    for ele in range(0, result.shape[0]):
        customer_id.append(result.iloc[ele][0])
    for ele in range(0, result.shape[0]):
        dif_rentals.append(result.iloc[ele][3])
    rental_month=list(map(lambda x: "May" if x > 0  else ("June" if x<0 else "Same"), dif_rentals))
    new_df=pd.DataFrame({"customer_id" : customer_id, "more_rentals_in":rental_month})
    return new_df

Sorry for the lack of documentation - also most likely a lot of those lines of code could be cut. But it works

In [15]:
rental(data_may, data_june)

     customer_id more_rentals_in
0            197            Same
1             19             May
2            371            June
3            245             May
4            274             May
..           ...             ...
592          598            June
593          487            June
594          555            June
595          425            June
596          335            June

[597 rows x 2 columns]